'use strict'

/* С помощью цикла do…while написать алгоритм для вывода чисел от 0 до 10
включительно, чтобы результат выглядел так:
```
0 – это ноль
1 – нечетное число
2 – четное число
3 – нечетное число
10 – четное число
*/

/*let i = 0;
do {
    if (i == 0) {
        alert(`${i} - это ноль`);
    } else if (i % 2 == 1) {
        alert(`${i} - это нечётное число`);
    } else {
        alert(`${i} - это четное число`);
    }
    i++;

} while (i < 11);
alert ('Конец.');
*/

/* Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть
выглядеть должно вот так:
```
for(…){ здесь пусто } */

//for (let i = 0; i < 10; alert(i++)) {}

/*
Нарисовать горку с помощью console.log (используя цикл for), как показано на
рисунке,
только у вашей горки должно быть 20 рядов, а не 5:
xxx
xxxxx
xxxxxxx
xxxxxxxxx
*/

//for (let i = 0, str = ''; i < 20; i++, console.log(str += 'x')) {}





